GopalSaraf/Practicals/PSDL/include/proc/pic18f86j94.inc
// Register: RPOR36_37
#define RPOR36_37 RPOR36_37
RPOR36_37                                equ 0E24h
// bitfield definitions
RPOR36_37_RPO36R_POSN                    equ 0000h
RPOR36_37_RPO36R_POSITION                equ 0000h
RPOR36_37_RPO36R_SIZE                    equ 0004h
RPOR36_37_RPO36R_LENGTH                  equ 0004h
RPOR36_37_RPO36R_MASK                    equ 000Fh
RPOR36_37_RPO37R_POSN                    equ 0004h
RPOR36_37_RPO37R_POSITION                equ 0004h
RPOR36_37_RPO37R_SIZE                    equ 0004h
RPOR36_37_RPO37R_LENGTH                  equ 0004h
RPOR36_37_RPO37R_MASK                    equ 00F0h
RPOR36_37_RPO36R0_POSN                   equ 0000h
RPOR36_37_RPO36R0_POSITION               equ 0000h
RPOR36_37_RPO36R0_SIZE                   equ 0001h
RPOR36_37_RPO36R0_LENGTH                 equ 0001h
RPOR36_37_RPO36R0_MASK                   equ 0001h
RPOR36_37_RPO36R1_POSN                   equ 0001h
RPOR36_37_RPO36R1_POSITION               equ 0001h
RPOR36_37_RPO36R1_SIZE                   equ 0001h
RPOR36_37_RPO36R1_LENGTH                 equ 0001h
RPOR36_37_RPO36R1_MASK                   equ 0002h
RPOR36_37_RPO36R2_POSN                   equ 0002h
RPOR36_37_RPO36R2_POSITION               equ 0002h
RPOR36_37_RPO36R2_SIZE                   equ 0001h
RPOR36_37_RPO36R2_LENGTH                 equ 0001h
RPOR36_37_RPO36R2_MASK                   equ 0004h
RPOR36_37_RPO36R3_POSN                   equ 0003h
RPOR36_37_RPO36R3_POSITION               equ 0003h
RPOR36_37_RPO36R3_SIZE                   equ 0001h
RPOR36_37_RPO36R3_LENGTH                 equ 0001h
RPOR36_37_RPO36R3_MASK                   equ 0008h
RPOR36_37_RPO37R0_POSN                   equ 0004h
RPOR36_37_RPO37R0_POSITION               equ 0004h
RPOR36_37_RPO37R0_SIZE                   equ 0001h
RPOR36_37_RPO37R0_LENGTH                 equ 0001h
RPOR36_37_RPO37R0_MASK                   equ 0010h
RPOR36_37_RPO37R1_POSN                   equ 0005h
RPOR36_37_RPO37R1_POSITION               equ 0005h
RPOR36_37_RPO37R1_SIZE                   equ 0001h
RPOR36_37_RPO37R1_LENGTH                 equ 0001h
RPOR36_37_RPO37R1_MASK                   equ 0020h
RPOR36_37_RPO37R2_POSN                   equ 0006h
RPOR36_37_RPO37R2_POSITION               equ 0006h
RPOR36_37_RPO37R2_SIZE                   equ 0001h
RPOR36_37_RPO37R2_LENGTH                 equ 0001h
RPOR36_37_RPO37R2_MASK                   equ 0040h
RPOR36_37_RPO37R3_POSN                   equ 0007h
RPOR36_37_RPO37R3_POSITION               equ 0007h
RPOR36_37_RPO37R3_SIZE                   equ 0001h
RPOR36_37_RPO37R3_LENGTH                 equ 0001h
RPOR36_37_RPO37R3_MASK                   equ 0080h

// Register: RPOR38_39
#define RPOR38_39 RPOR38_39
RPOR38_39                                equ 0E25h
// bitfield definitions
RPOR38_39_RPO38R_POSN                    equ 0000h
RPOR38_39_RPO38R_POSITION                equ 0000h
RPOR38_39_RPO38R_SIZE                    equ 0004h
RPOR38_39_RPO38R_LENGTH                  equ 0004h
RPOR38_39_RPO38R_MASK                    equ 000Fh
RPOR38_39_RPO39R_POSN                    equ 0004h
RPOR38_39_RPO39R_POSITION                equ 0004h
RPOR38_39_RPO39R_SIZE                    equ 0004h
RPOR38_39_RPO39R_LENGTH                  equ 0004h
RPOR38_39_RPO39R_MASK                    equ 00F0h
RPOR38_39_RPO38R0_POSN                   equ 0000h
RPOR38_39_RPO38R0_POSITION               equ 0000h
RPOR38_39_RPO38R0_SIZE                   equ 0001h
RPOR38_39_RPO38R0_LENGTH                 equ 0001h
RPOR38_39_RPO38R0_MASK                   equ 0001h
RPOR38_39_RPO38R1_POSN                   equ 0001h
RPOR38_39_RPO38R1_POSITION               equ 0001h
RPOR38_39_RPO38R1_SIZE                   equ 0001h
RPOR38_39_RPO38R1_LENGTH                 equ 0001h
RPOR38_39_RPO38R1_MASK                   equ 0002h
RPOR38_39_RPO38R2_POSN                   equ 0002h
RPOR38_39_RPO38R2_POSITION               equ 0002h
RPOR38_39_RPO38R2_SIZE                   equ 0001h
RPOR38_39_RPO38R2_LENGTH                 equ 0001h
RPOR38_39_RPO38R2_MASK                   equ 0004h
RPOR38_39_RPO38R3_POSN                   equ 0003h
RPOR38_39_RPO38R3_POSITION               equ 0003h
RPOR38_39_RPO38R3_SIZE                   equ 0001h
RPOR38_39_RPO38R3_LENGTH                 equ 0001h
RPOR38_39_RPO38R3_MASK                   equ 0008h
RPOR38_39_RPO39R0_POSN                   equ 0004h
RPOR38_39_RPO39R0_POSITION               equ 0004h
RPOR38_39_RPO39R0_SIZE                   equ 0001h
RPOR38_39_RPO39R0_LENGTH                 equ 0001h
RPOR38_39_RPO39R0_MASK                   equ 0010h
RPOR38_39_RPO39R1_POSN                   equ 0005h
RPOR38_39_RPO39R1_POSITION               equ 0005h
RPOR38_39_RPO39R1_SIZE                   equ 0001h
RPOR38_39_RPO39R1_LENGTH                 equ 0001h
RPOR38_39_RPO39R1_MASK                   equ 0020h
RPOR38_39_RPO39R2_POSN                   equ 0006h
RPOR38_39_RPO39R2_POSITION               equ 0006h
RPOR38_39_RPO39R2_SIZE                   equ 0001h
RPOR38_39_RPO39R2_LENGTH                 equ 0001h
RPOR38_39_RPO39R2_MASK                   equ 0040h
RPOR38_39_RPO39R3_POSN                   equ 0007h
RPOR38_39_RPO39R3_POSITION               equ 0007h
RPOR38_39_RPO39R3_SIZE                   equ 0001h
RPOR38_39_RPO39R3_LENGTH                 equ 0001h
RPOR38_39_RPO39R3_MASK                   equ 0080h

// Register: RPOR40_41
#define RPOR40_41 RPOR40_41
RPOR40_41                                equ 0E26h
// bitfield definitions
RPOR40_41_RPO40R_POSN                    equ 0000h
RPOR40_41_RPO40R_POSITION                equ 0000h
RPOR40_41_RPO40R_SIZE                    equ 0004h
RPOR40_41_RPO40R_LENGTH                  equ 0004h
RPOR40_41_RPO40R_MASK                    equ 000Fh
RPOR40_41_RPO41R_POSN                    equ 0004h
RPOR40_41_RPO41R_POSITION                equ 0004h
RPOR40_41_RPO41R_SIZE                    equ 0004h
RPOR40_41_RPO41R_LENGTH                  equ 0004h
RPOR40_41_RPO41R_MASK                    equ 00F0h
RPOR40_41_RPO40R0_POSN                   equ 0000h
RPOR40_41_RPO40R0_POSITION               equ 0000h
RPOR40_41_RPO40R0_SIZE                   equ 0001h
RPOR40_41_RPO40R0_LENGTH                 equ 0001h
RPOR40_41_RPO40R0_MASK                   equ 0001h
RPOR40_41_RPO40R1_POSN                   equ 0001h
RPOR40_41_RPO40R1_POSITION               equ 0001h
RPOR40_41_RPO40R1_SIZE                   equ 0001h
RPOR40_41_RPO40R1_LENGTH                 equ 0001h
RPOR40_41_RPO40R1_MASK                   equ 0002h
RPOR40_41_RPO40R2_POSN                   equ 0002h
RPOR40_41_RPO40R2_POSITION               equ 0002h
RPOR40_41_RPO40R2_SIZE                   equ 0001h
RPOR40_41_RPO40R2_LENGTH                 equ 0001h
RPOR40_41_RPO40R2_MASK                   equ 0004h
RPOR40_41_RPO40R3_POSN                   equ 0003h
RPOR40_41_RPO40R3_POSITION               equ 0003h
RPOR40_41_RPO40R3_SIZE                   equ 0001h
RPOR40_41_RPO40R3_LENGTH                 equ 0001h
RPOR40_41_RPO40R3_MASK                   equ 0008h
RPOR40_41_RPO41R0_POSN                   equ 0004h
RPOR40_41_RPO41R0_POSITION               equ 0004h
RPOR40_41_RPO41R0_SIZE                   equ 0001h
RPOR40_41_RPO41R0_LENGTH                 equ 0001h
RPOR40_41_RPO41R0_MASK                   equ 0010h
RPOR40_41_RPO41R1_POSN                   equ 0005h
RPOR40_41_RPO41R1_POSITION               equ 0005h
RPOR40_41_RPO41R1_SIZE                   equ 0001h
RPOR40_41_RPO41R1_LENGTH                 equ 0001h
RPOR40_41_RPO41R1_MASK                   equ 0020h
RPOR40_41_RPO41R2_POSN                   equ 0006h
RPOR40_41_RPO41R2_POSITION               equ 0006h
RPOR40_41_RPO41R2_SIZE                   equ 0001h
RPOR40_41_RPO41R2_LENGTH                 equ 0001h
RPOR40_41_RPO41R2_MASK                   equ 0040h
RPOR40_41_RPO41R3_POSN                   equ 0007h
RPOR40_41_RPO41R3_POSITION               equ 0007h
RPOR40_41_RPO41R3_SIZE                   equ 0001h
RPOR40_41_RPO41R3_LENGTH                 equ 0001h
RPOR40_41_RPO41R3_MASK                   equ 0080h

// Register: RPOR42_43
#define RPOR42_43 RPOR42_43
RPOR42_43                                equ 0E27h
// bitfield definitions
RPOR42_43_RPO42R_POSN                    equ 0000h
RPOR42_43_RPO42R_POSITION                equ 0000h
RPOR42_43_RPO42R_SIZE                    equ 0004h
RPOR42_43_RPO42R_LENGTH                  equ 0004h
RPOR42_43_RPO42R_MASK                    equ 000Fh
RPOR42_43_RPO43R_POSN                    equ 0004h
RPOR42_43_RPO43R_POSITION                equ 0004h
RPOR42_43_RPO43R_SIZE                    equ 0004h
RPOR42_43_RPO43R_LENGTH                  equ 0004h
RPOR42_43_RPO43R_MASK                    equ 00F0h
RPOR42_43_RPO42R0_POSN                   equ 0000h
RPOR42_43_RPO42R0_POSITION               equ 0000h
RPOR42_43_RPO42R0_SIZE                   equ 0001h
RPOR42_43_RPO42R0_LENGTH                 equ 0001h
RPOR42_43_RPO42R0_MASK                   equ 0001h
RPOR42_43_RPO42R1_POSN                   equ 0001h
RPOR42_43_RPO42R1_POSITION               equ 0001h
RPOR42_43_RPO42R1_SIZE                   equ 0001h
RPOR42_43_RPO42R1_LENGTH                 equ 0001h
RPOR42_43_RPO42R1_MASK                   equ 0002h
RPOR42_43_RPO42R2_POSN                   equ 0002h
RPOR42_43_RPO42R2_POSITION               equ 0002h
RPOR42_43_RPO42R2_SIZE                   equ 0001h
RPOR42_43_RPO42R2_LENGTH                 equ 0001h
RPOR42_43_RPO42R2_MASK                   equ 0004h
RPOR42_43_RPO42R3_POSN                   equ 0003h
RPOR42_43_RPO42R3_POSITION               equ 0003h
RPOR42_43_RPO42R3_SIZE                   equ 0001h
RPOR42_43_RPO42R3_LENGTH                 equ 0001h
RPOR42_43_RPO42R3_MASK                   equ 0008h
RPOR42_43_RPO43R0_POSN                   equ 0004h
RPOR42_43_RPO43R0_POSITION               equ 0004h
RPOR42_43_RPO43R0_SIZE                   equ 0001h
RPOR42_43_RPO43R0_LENGTH                 equ 0001h
RPOR42_43_RPO43R0_MASK                   equ 0010h
RPOR42_43_RPO43R1_POSN                   equ 0005h
RPOR42_43_RPO43R1_POSITION               equ 0005h
RPOR42_43_RPO43R1_SIZE                   equ 0001h
RPOR42_43_RPO43R1_LENGTH                 equ 0001h
RPOR42_43_RPO43R1_MASK                   equ 0020h
RPOR42_43_RPO43R2_POSN                   equ 0006h
RPOR42_43_RPO43R2_POSITION               equ 0006h
RPOR42_43_RPO43R2_SIZE                   equ 0001h
RPOR42_43_RPO43R2_LENGTH                 equ 0001h
RPOR42_43_RPO43R2_MASK                   equ 0040h
RPOR42_43_RPO43R3_POSN                   equ 0007h
RPOR42_43_RPO43R3_POSITION               equ 0007h
RPOR42_43_RPO43R3_SIZE                   equ 0001h
RPOR42_43_RPO43R3_LENGTH                 equ 0001h
RPOR42_43_RPO43R3_MASK                   equ 0080h

