GopalSaraf/Practicals/PSDL/include/proc/pic18f86j94.inc
// Register: RPINR20_21
#define RPINR20_21 RPINR20_21
RPINR20_21                               equ 0E34h
// bitfield definitions
RPINR20_21_IOC2R_POSN                    equ 0000h
RPINR20_21_IOC2R_POSITION                equ 0000h
RPINR20_21_IOC2R_SIZE                    equ 0004h
RPINR20_21_IOC2R_LENGTH                  equ 0004h
RPINR20_21_IOC2R_MASK                    equ 000Fh
RPINR20_21_IOC3R_POSN                    equ 0004h
RPINR20_21_IOC3R_POSITION                equ 0004h
RPINR20_21_IOC3R_SIZE                    equ 0004h
RPINR20_21_IOC3R_LENGTH                  equ 0004h
RPINR20_21_IOC3R_MASK                    equ 00F0h
RPINR20_21_IOC2R0_POSN                   equ 0000h
RPINR20_21_IOC2R0_POSITION               equ 0000h
RPINR20_21_IOC2R0_SIZE                   equ 0001h
RPINR20_21_IOC2R0_LENGTH                 equ 0001h
RPINR20_21_IOC2R0_MASK                   equ 0001h
RPINR20_21_IOC2R1_POSN                   equ 0001h
RPINR20_21_IOC2R1_POSITION               equ 0001h
RPINR20_21_IOC2R1_SIZE                   equ 0001h
RPINR20_21_IOC2R1_LENGTH                 equ 0001h
RPINR20_21_IOC2R1_MASK                   equ 0002h
RPINR20_21_IOC2R2_POSN                   equ 0002h
RPINR20_21_IOC2R2_POSITION               equ 0002h
RPINR20_21_IOC2R2_SIZE                   equ 0001h
RPINR20_21_IOC2R2_LENGTH                 equ 0001h
RPINR20_21_IOC2R2_MASK                   equ 0004h
RPINR20_21_IOC2R3_POSN                   equ 0003h
RPINR20_21_IOC2R3_POSITION               equ 0003h
RPINR20_21_IOC2R3_SIZE                   equ 0001h
RPINR20_21_IOC2R3_LENGTH                 equ 0001h
RPINR20_21_IOC2R3_MASK                   equ 0008h
RPINR20_21_IOC3R0_POSN                   equ 0004h
RPINR20_21_IOC3R0_POSITION               equ 0004h
RPINR20_21_IOC3R0_SIZE                   equ 0001h
RPINR20_21_IOC3R0_LENGTH                 equ 0001h
RPINR20_21_IOC3R0_MASK                   equ 0010h
RPINR20_21_IOC3R1_POSN                   equ 0005h
RPINR20_21_IOC3R1_POSITION               equ 0005h
RPINR20_21_IOC3R1_SIZE                   equ 0001h
RPINR20_21_IOC3R1_LENGTH                 equ 0001h
RPINR20_21_IOC3R1_MASK                   equ 0020h
RPINR20_21_IOC3R2_POSN                   equ 0006h
RPINR20_21_IOC3R2_POSITION               equ 0006h
RPINR20_21_IOC3R2_SIZE                   equ 0001h
RPINR20_21_IOC3R2_LENGTH                 equ 0001h
RPINR20_21_IOC3R2_MASK                   equ 0040h
RPINR20_21_IOC3R3_POSN                   equ 0007h
RPINR20_21_IOC3R3_POSITION               equ 0007h
RPINR20_21_IOC3R3_SIZE                   equ 0001h
RPINR20_21_IOC3R3_LENGTH                 equ 0001h
RPINR20_21_IOC3R3_MASK                   equ 0080h

// Register: RPINR22_23
#define RPINR22_23 RPINR22_23
RPINR22_23                               equ 0E35h
// bitfield definitions
RPINR22_23_IOC4R_POSN                    equ 0000h
RPINR22_23_IOC4R_POSITION                equ 0000h
RPINR22_23_IOC4R_SIZE                    equ 0004h
RPINR22_23_IOC4R_LENGTH                  equ 0004h
RPINR22_23_IOC4R_MASK                    equ 000Fh
RPINR22_23_IOC5R_POSN                    equ 0004h
RPINR22_23_IOC5R_POSITION                equ 0004h
RPINR22_23_IOC5R_SIZE                    equ 0004h
RPINR22_23_IOC5R_LENGTH                  equ 0004h
RPINR22_23_IOC5R_MASK                    equ 00F0h
RPINR22_23_IOC4R0_POSN                   equ 0000h
RPINR22_23_IOC4R0_POSITION               equ 0000h
RPINR22_23_IOC4R0_SIZE                   equ 0001h
RPINR22_23_IOC4R0_LENGTH                 equ 0001h
RPINR22_23_IOC4R0_MASK                   equ 0001h
RPINR22_23_IOC4R1_POSN                   equ 0001h
RPINR22_23_IOC4R1_POSITION               equ 0001h
RPINR22_23_IOC4R1_SIZE                   equ 0001h
RPINR22_23_IOC4R1_LENGTH                 equ 0001h
RPINR22_23_IOC4R1_MASK                   equ 0002h
RPINR22_23_IOC4R2_POSN                   equ 0002h
RPINR22_23_IOC4R2_POSITION               equ 0002h
RPINR22_23_IOC4R2_SIZE                   equ 0001h
RPINR22_23_IOC4R2_LENGTH                 equ 0001h
RPINR22_23_IOC4R2_MASK                   equ 0004h
RPINR22_23_IOC4R3_POSN                   equ 0003h
RPINR22_23_IOC4R3_POSITION               equ 0003h
RPINR22_23_IOC4R3_SIZE                   equ 0001h
RPINR22_23_IOC4R3_LENGTH                 equ 0001h
RPINR22_23_IOC4R3_MASK                   equ 0008h
RPINR22_23_IOC5R0_POSN                   equ 0004h
RPINR22_23_IOC5R0_POSITION               equ 0004h
RPINR22_23_IOC5R0_SIZE                   equ 0001h
RPINR22_23_IOC5R0_LENGTH                 equ 0001h
RPINR22_23_IOC5R0_MASK                   equ 0010h
RPINR22_23_IOC5R1_POSN                   equ 0005h
RPINR22_23_IOC5R1_POSITION               equ 0005h
RPINR22_23_IOC5R1_SIZE                   equ 0001h
RPINR22_23_IOC5R1_LENGTH                 equ 0001h
RPINR22_23_IOC5R1_MASK                   equ 0020h
RPINR22_23_IOC5R2_POSN                   equ 0006h
RPINR22_23_IOC5R2_POSITION               equ 0006h
RPINR22_23_IOC5R2_SIZE                   equ 0001h
RPINR22_23_IOC5R2_LENGTH                 equ 0001h
RPINR22_23_IOC5R2_MASK                   equ 0040h
RPINR22_23_IOC5R3_POSN                   equ 0007h
RPINR22_23_IOC5R3_POSITION               equ 0007h
RPINR22_23_IOC5R3_SIZE                   equ 0001h
RPINR22_23_IOC5R3_LENGTH                 equ 0001h
RPINR22_23_IOC5R3_MASK                   equ 0080h

// Register: RPINR24_25
#define RPINR24_25 RPINR24_25
RPINR24_25                               equ 0E36h
// bitfield definitions
RPINR24_25_IOC6R_POSN                    equ 0000h
RPINR24_25_IOC6R_POSITION                equ 0000h
RPINR24_25_IOC6R_SIZE                    equ 0004h
RPINR24_25_IOC6R_LENGTH                  equ 0004h
RPINR24_25_IOC6R_MASK                    equ 000Fh
RPINR24_25_IOC7R_POSN                    equ 0004h
RPINR24_25_IOC7R_POSITION                equ 0004h
RPINR24_25_IOC7R_SIZE                    equ 0004h
RPINR24_25_IOC7R_LENGTH                  equ 0004h
RPINR24_25_IOC7R_MASK                    equ 00F0h
RPINR24_25_IOC6R0_POSN                   equ 0000h
RPINR24_25_IOC6R0_POSITION               equ 0000h
RPINR24_25_IOC6R0_SIZE                   equ 0001h
RPINR24_25_IOC6R0_LENGTH                 equ 0001h
RPINR24_25_IOC6R0_MASK                   equ 0001h
RPINR24_25_IOC6R1_POSN                   equ 0001h
RPINR24_25_IOC6R1_POSITION               equ 0001h
RPINR24_25_IOC6R1_SIZE                   equ 0001h
RPINR24_25_IOC6R1_LENGTH                 equ 0001h
RPINR24_25_IOC6R1_MASK                   equ 0002h
RPINR24_25_IOC6R2_POSN                   equ 0002h
RPINR24_25_IOC6R2_POSITION               equ 0002h
RPINR24_25_IOC6R2_SIZE                   equ 0001h
RPINR24_25_IOC6R2_LENGTH                 equ 0001h
RPINR24_25_IOC6R2_MASK                   equ 0004h
RPINR24_25_IOC6R3_POSN                   equ 0003h
RPINR24_25_IOC6R3_POSITION               equ 0003h
RPINR24_25_IOC6R3_SIZE                   equ 0001h
RPINR24_25_IOC6R3_LENGTH                 equ 0001h
RPINR24_25_IOC6R3_MASK                   equ 0008h
RPINR24_25_IOC7R0_POSN                   equ 0004h
RPINR24_25_IOC7R0_POSITION               equ 0004h
RPINR24_25_IOC7R0_SIZE                   equ 0001h
RPINR24_25_IOC7R0_LENGTH                 equ 0001h
RPINR24_25_IOC7R0_MASK                   equ 0010h
RPINR24_25_IOC7R1_POSN                   equ 0005h
RPINR24_25_IOC7R1_POSITION               equ 0005h
RPINR24_25_IOC7R1_SIZE                   equ 0001h
RPINR24_25_IOC7R1_LENGTH                 equ 0001h
RPINR24_25_IOC7R1_MASK                   equ 0020h
RPINR24_25_IOC7R2_POSN                   equ 0006h
RPINR24_25_IOC7R2_POSITION               equ 0006h
RPINR24_25_IOC7R2_SIZE                   equ 0001h
RPINR24_25_IOC7R2_LENGTH                 equ 0001h
RPINR24_25_IOC7R2_MASK                   equ 0040h
RPINR24_25_IOC7R3_POSN                   equ 0007h
RPINR24_25_IOC7R3_POSITION               equ 0007h
RPINR24_25_IOC7R3_SIZE                   equ 0001h
RPINR24_25_IOC7R3_LENGTH                 equ 0001h
RPINR24_25_IOC7R3_MASK                   equ 0080h

// Register: RPINR26_27
#define RPINR26_27 RPINR26_27
RPINR26_27                               equ 0E37h
// bitfield definitions
RPINR26_27_INT1R_POSN                    equ 0000h
RPINR26_27_INT1R_POSITION                equ 0000h
RPINR26_27_INT1R_SIZE                    equ 0004h
RPINR26_27_INT1R_LENGTH                  equ 0004h
RPINR26_27_INT1R_MASK                    equ 000Fh
RPINR26_27_INT2R_POSN                    equ 0004h
RPINR26_27_INT2R_POSITION                equ 0004h
RPINR26_27_INT2R_SIZE                    equ 0004h
RPINR26_27_INT2R_LENGTH                  equ 0004h
RPINR26_27_INT2R_MASK                    equ 00F0h
RPINR26_27_INT1R0_POSN                   equ 0000h
RPINR26_27_INT1R0_POSITION               equ 0000h
RPINR26_27_INT1R0_SIZE                   equ 0001h
RPINR26_27_INT1R0_LENGTH                 equ 0001h
RPINR26_27_INT1R0_MASK                   equ 0001h
RPINR26_27_INT1R1_POSN                   equ 0001h
RPINR26_27_INT1R1_POSITION               equ 0001h
RPINR26_27_INT1R1_SIZE                   equ 0001h
RPINR26_27_INT1R1_LENGTH                 equ 0001h
RPINR26_27_INT1R1_MASK                   equ 0002h
RPINR26_27_INT1R2_POSN                   equ 0002h
RPINR26_27_INT1R2_POSITION               equ 0002h
RPINR26_27_INT1R2_SIZE                   equ 0001h
RPINR26_27_INT1R2_LENGTH                 equ 0001h
RPINR26_27_INT1R2_MASK                   equ 0004h
RPINR26_27_INT1R3_POSN                   equ 0003h
RPINR26_27_INT1R3_POSITION               equ 0003h
RPINR26_27_INT1R3_SIZE                   equ 0001h
RPINR26_27_INT1R3_LENGTH                 equ 0001h
RPINR26_27_INT1R3_MASK                   equ 0008h
RPINR26_27_INT2R0_POSN                   equ 0004h
RPINR26_27_INT2R0_POSITION               equ 0004h
RPINR26_27_INT2R0_SIZE                   equ 0001h
RPINR26_27_INT2R0_LENGTH                 equ 0001h
RPINR26_27_INT2R0_MASK                   equ 0010h
RPINR26_27_INT2R1_POSN                   equ 0005h
RPINR26_27_INT2R1_POSITION               equ 0005h
RPINR26_27_INT2R1_SIZE                   equ 0001h
RPINR26_27_INT2R1_LENGTH                 equ 0001h
RPINR26_27_INT2R1_MASK                   equ 0020h
RPINR26_27_INT2R2_POSN                   equ 0006h
RPINR26_27_INT2R2_POSITION               equ 0006h
RPINR26_27_INT2R2_SIZE                   equ 0001h
RPINR26_27_INT2R2_LENGTH                 equ 0001h
RPINR26_27_INT2R2_MASK                   equ 0040h
RPINR26_27_INT2R3_POSN                   equ 0007h
RPINR26_27_INT2R3_POSITION               equ 0007h
RPINR26_27_INT2R3_SIZE                   equ 0001h
RPINR26_27_INT2R3_LENGTH                 equ 0001h
RPINR26_27_INT2R3_MASK                   equ 0080h

// Register: RPINR28_29
#define RPINR28_29 RPINR28_29
RPINR28_29                               equ 0E38h
// bitfield definitions
RPINR28_29_INT3R_POSN                    equ 0000h
RPINR28_29_INT3R_POSITION                equ 0000h
RPINR28_29_INT3R_SIZE                    equ 0004h
RPINR28_29_INT3R_LENGTH                  equ 0004h
RPINR28_29_INT3R_MASK                    equ 000Fh
RPINR28_29_MDMINR_POSN                   equ 0004h
RPINR28_29_MDMINR_POSITION               equ 0004h
RPINR28_29_MDMINR_SIZE                   equ 0004h
RPINR28_29_MDMINR_LENGTH                 equ 0004h
RPINR28_29_MDMINR_MASK                   equ 00F0h
RPINR28_29_INT3R0_POSN                   equ 0000h
RPINR28_29_INT3R0_POSITION               equ 0000h
RPINR28_29_INT3R0_SIZE                   equ 0001h
RPINR28_29_INT3R0_LENGTH                 equ 0001h
RPINR28_29_INT3R0_MASK                   equ 0001h
RPINR28_29_INT3R1_POSN                   equ 0001h
RPINR28_29_INT3R1_POSITION               equ 0001h
RPINR28_29_INT3R1_SIZE                   equ 0001h
RPINR28_29_INT3R1_LENGTH                 equ 0001h
RPINR28_29_INT3R1_MASK                   equ 0002h
RPINR28_29_INT3R2_POSN                   equ 0002h
RPINR28_29_INT3R2_POSITION               equ 0002h
RPINR28_29_INT3R2_SIZE                   equ 0001h
RPINR28_29_INT3R2_LENGTH                 equ 0001h
RPINR28_29_INT3R2_MASK                   equ 0004h
RPINR28_29_INT3R3_POSN                   equ 0003h
RPINR28_29_INT3R3_POSITION               equ 0003h
RPINR28_29_INT3R3_SIZE                   equ 0001h
RPINR28_29_INT3R3_LENGTH                 equ 0001h
RPINR28_29_INT3R3_MASK                   equ 0008h
RPINR28_29_MDMINR0_POSN                  equ 0004h
RPINR28_29_MDMINR0_POSITION              equ 0004h
RPINR28_29_MDMINR0_SIZE                  equ 0001h
RPINR28_29_MDMINR0_LENGTH                equ 0001h
RPINR28_29_MDMINR0_MASK                  equ 0010h
RPINR28_29_MDMINR1_POSN                  equ 0005h
RPINR28_29_MDMINR1_POSITION              equ 0005h
RPINR28_29_MDMINR1_SIZE                  equ 0001h
RPINR28_29_MDMINR1_LENGTH                equ 0001h
RPINR28_29_MDMINR1_MASK                  equ 0020h
RPINR28_29_MDMINR2_POSN                  equ 0006h
RPINR28_29_MDMINR2_POSITION              equ 0006h
RPINR28_29_MDMINR2_SIZE                  equ 0001h
RPINR28_29_MDMINR2_LENGTH                equ 0001h
RPINR28_29_MDMINR2_MASK                  equ 0040h
RPINR28_29_MDMINR3_POSN                  equ 0007h
RPINR28_29_MDMINR3_POSITION              equ 0007h
RPINR28_29_MDMINR3_SIZE                  equ 0001h
RPINR28_29_MDMINR3_LENGTH                equ 0001h
RPINR28_29_MDMINR3_MASK                  equ 0080h

// Register: RPINR30_31
#define RPINR30_31 RPINR30_31
RPINR30_31                               equ 0E39h
// bitfield definitions
RPINR30_31_MDCIN1R_POSN                  equ 0000h
RPINR30_31_MDCIN1R_POSITION              equ 0000h
RPINR30_31_MDCIN1R_SIZE                  equ 0004h
RPINR30_31_MDCIN1R_LENGTH                equ 0004h
RPINR30_31_MDCIN1R_MASK                  equ 000Fh
RPINR30_31_MDCIN2R_POSN                  equ 0004h
RPINR30_31_MDCIN2R_POSITION              equ 0004h
RPINR30_31_MDCIN2R_SIZE                  equ 0004h
RPINR30_31_MDCIN2R_LENGTH                equ 0004h
RPINR30_31_MDCIN2R_MASK                  equ 00F0h
RPINR30_31_MDCIN1R0_POSN                 equ 0000h
RPINR30_31_MDCIN1R0_POSITION             equ 0000h
RPINR30_31_MDCIN1R0_SIZE                 equ 0001h
RPINR30_31_MDCIN1R0_LENGTH               equ 0001h
RPINR30_31_MDCIN1R0_MASK                 equ 0001h
RPINR30_31_MDCIN1R1_POSN                 equ 0001h
RPINR30_31_MDCIN1R1_POSITION             equ 0001h
RPINR30_31_MDCIN1R1_SIZE                 equ 0001h
RPINR30_31_MDCIN1R1_LENGTH               equ 0001h
RPINR30_31_MDCIN1R1_MASK                 equ 0002h
RPINR30_31_MDCIN1R2_POSN                 equ 0002h
RPINR30_31_MDCIN1R2_POSITION             equ 0002h
RPINR30_31_MDCIN1R2_SIZE                 equ 0001h
RPINR30_31_MDCIN1R2_LENGTH               equ 0001h
RPINR30_31_MDCIN1R2_MASK                 equ 0004h
RPINR30_31_MDCIN1R3_POSN                 equ 0003h
RPINR30_31_MDCIN1R3_POSITION             equ 0003h
RPINR30_31_MDCIN1R3_SIZE                 equ 0001h
RPINR30_31_MDCIN1R3_LENGTH               equ 0001h
RPINR30_31_MDCIN1R3_MASK                 equ 0008h
RPINR30_31_MDCIN2R0_POSN                 equ 0004h
RPINR30_31_MDCIN2R0_POSITION             equ 0004h
RPINR30_31_MDCIN2R0_SIZE                 equ 0001h
RPINR30_31_MDCIN2R0_LENGTH               equ 0001h
RPINR30_31_MDCIN2R0_MASK                 equ 0010h
RPINR30_31_MDCIN2R1_POSN                 equ 0005h
RPINR30_31_MDCIN2R1_POSITION             equ 0005h
RPINR30_31_MDCIN2R1_SIZE                 equ 0001h
RPINR30_31_MDCIN2R1_LENGTH               equ 0001h
RPINR30_31_MDCIN2R1_MASK                 equ 0020h
RPINR30_31_MDCIN2R2_POSN                 equ 0006h
RPINR30_31_MDCIN2R2_POSITION             equ 0006h
RPINR30_31_MDCIN2R2_SIZE                 equ 0001h
RPINR30_31_MDCIN2R2_LENGTH               equ 0001h
RPINR30_31_MDCIN2R2_MASK                 equ 0040h
RPINR30_31_MDCIN2R3_POSN                 equ 0007h
RPINR30_31_MDCIN2R3_POSITION             equ 0007h
RPINR30_31_MDCIN2R3_SIZE                 equ 0001h
RPINR30_31_MDCIN2R3_LENGTH               equ 0001h
RPINR30_31_MDCIN2R3_MASK                 equ 0080h

// Register: RPINR32_33
#define RPINR32_33 RPINR32_33
RPINR32_33                               equ 0E3Ah
// bitfield definitions
RPINR32_33_CCP4R_POSN                    equ 0000h
RPINR32_33_CCP4R_POSITION                equ 0000h
RPINR32_33_CCP4R_SIZE                    equ 0004h
RPINR32_33_CCP4R_LENGTH                  equ 0004h
RPINR32_33_CCP4R_MASK                    equ 000Fh
RPINR32_33_CCP5R_POSN                    equ 0004h
RPINR32_33_CCP5R_POSITION                equ 0004h
RPINR32_33_CCP5R_SIZE                    equ 0004h
RPINR32_33_CCP5R_LENGTH                  equ 0004h
RPINR32_33_CCP5R_MASK                    equ 00F0h
RPINR32_33_CCP4R0_POSN                   equ 0000h
RPINR32_33_CCP4R0_POSITION               equ 0000h
RPINR32_33_CCP4R0_SIZE                   equ 0001h
RPINR32_33_CCP4R0_LENGTH                 equ 0001h
RPINR32_33_CCP4R0_MASK                   equ 0001h
RPINR32_33_CCP4R1_POSN                   equ 0001h
RPINR32_33_CCP4R1_POSITION               equ 0001h
RPINR32_33_CCP4R1_SIZE                   equ 0001h
RPINR32_33_CCP4R1_LENGTH                 equ 0001h
RPINR32_33_CCP4R1_MASK                   equ 0002h
RPINR32_33_CCP4R2_POSN                   equ 0002h
RPINR32_33_CCP4R2_POSITION               equ 0002h
RPINR32_33_CCP4R2_SIZE                   equ 0001h
RPINR32_33_CCP4R2_LENGTH                 equ 0001h
RPINR32_33_CCP4R2_MASK                   equ 0004h
RPINR32_33_CCP4R3_POSN                   equ 0003h
RPINR32_33_CCP4R3_POSITION               equ 0003h
RPINR32_33_CCP4R3_SIZE                   equ 0001h
RPINR32_33_CCP4R3_LENGTH                 equ 0001h
RPINR32_33_CCP4R3_MASK                   equ 0008h
RPINR32_33_CCP5R0_POSN                   equ 0004h
RPINR32_33_CCP5R0_POSITION               equ 0004h
RPINR32_33_CCP5R0_SIZE                   equ 0001h
RPINR32_33_CCP5R0_LENGTH                 equ 0001h
RPINR32_33_CCP5R0_MASK                   equ 0010h
RPINR32_33_CCP5R1_POSN                   equ 0005h
RPINR32_33_CCP5R1_POSITION               equ 0005h
RPINR32_33_CCP5R1_SIZE                   equ 0001h
RPINR32_33_CCP5R1_LENGTH                 equ 0001h
RPINR32_33_CCP5R1_MASK                   equ 0020h
RPINR32_33_CCP5R2_POSN                   equ 0006h
RPINR32_33_CCP5R2_POSITION               equ 0006h
RPINR32_33_CCP5R2_SIZE                   equ 0001h
RPINR32_33_CCP5R2_LENGTH                 equ 0001h
RPINR32_33_CCP5R2_MASK                   equ 0040h
RPINR32_33_CCP5R3_POSN                   equ 0007h
RPINR32_33_CCP5R3_POSITION               equ 0007h
RPINR32_33_CCP5R3_SIZE                   equ 0001h
RPINR32_33_CCP5R3_LENGTH                 equ 0001h
RPINR32_33_CCP5R3_MASK                   equ 0080h

// Register: RPINR34_35
#define RPINR34_35 RPINR34_35
RPINR34_35                               equ 0E3Bh
// bitfield definitions
RPINR34_35_CCP6R_POSN                    equ 0000h
RPINR34_35_CCP6R_POSITION                equ 0000h
RPINR34_35_CCP6R_SIZE                    equ 0004h
RPINR34_35_CCP6R_LENGTH                  equ 0004h
RPINR34_35_CCP6R_MASK                    equ 000Fh
RPINR34_35_CCP7R_POSN                    equ 0004h
RPINR34_35_CCP7R_POSITION                equ 0004h
RPINR34_35_CCP7R_SIZE                    equ 0004h
RPINR34_35_CCP7R_LENGTH                  equ 0004h
RPINR34_35_CCP7R_MASK                    equ 00F0h
RPINR34_35_CCP6R0_POSN                   equ 0000h
RPINR34_35_CCP6R0_POSITION               equ 0000h
RPINR34_35_CCP6R0_SIZE                   equ 0001h
RPINR34_35_CCP6R0_LENGTH                 equ 0001h
RPINR34_35_CCP6R0_MASK                   equ 0001h
RPINR34_35_CCP6R1_POSN                   equ 0001h
RPINR34_35_CCP6R1_POSITION               equ 0001h
RPINR34_35_CCP6R1_SIZE                   equ 0001h
RPINR34_35_CCP6R1_LENGTH                 equ 0001h
RPINR34_35_CCP6R1_MASK                   equ 0002h
RPINR34_35_CCP6R2_POSN                   equ 0002h
RPINR34_35_CCP6R2_POSITION               equ 0002h
RPINR34_35_CCP6R2_SIZE                   equ 0001h
RPINR34_35_CCP6R2_LENGTH                 equ 0001h
RPINR34_35_CCP6R2_MASK                   equ 0004h
RPINR34_35_CCP6R3_POSN                   equ 0003h
RPINR34_35_CCP6R3_POSITION               equ 0003h
RPINR34_35_CCP6R3_SIZE                   equ 0001h
RPINR34_35_CCP6R3_LENGTH                 equ 0001h
RPINR34_35_CCP6R3_MASK                   equ 0008h
RPINR34_35_CCP7R0_POSN                   equ 0004h
RPINR34_35_CCP7R0_POSITION               equ 0004h
RPINR34_35_CCP7R0_SIZE                   equ 0001h
RPINR34_35_CCP7R0_LENGTH                 equ 0001h
RPINR34_35_CCP7R0_MASK                   equ 0010h
RPINR34_35_CCP7R1_POSN                   equ 0005h
RPINR34_35_CCP7R1_POSITION               equ 0005h
RPINR34_35_CCP7R1_SIZE                   equ 0001h
RPINR34_35_CCP7R1_LENGTH                 equ 0001h
RPINR34_35_CCP7R1_MASK                   equ 0020h
RPINR34_35_CCP7R2_POSN                   equ 0006h
RPINR34_35_CCP7R2_POSITION               equ 0006h
RPINR34_35_CCP7R2_SIZE                   equ 0001h
RPINR34_35_CCP7R2_LENGTH                 equ 0001h
RPINR34_35_CCP7R2_MASK                   equ 0040h
RPINR34_35_CCP7R3_POSN                   equ 0007h
RPINR34_35_CCP7R3_POSITION               equ 0007h
RPINR34_35_CCP7R3_SIZE                   equ 0001h
RPINR34_35_CCP7R3_LENGTH                 equ 0001h
RPINR34_35_CCP7R3_MASK                   equ 0080h

