GopalSaraf/Practicals/PSDL/include/proc/pic18f86j94.inc
// Register: RPINR44_45
#define RPINR44_45 RPINR44_45
RPINR44_45                               equ 0E40h
// bitfield definitions
RPINR44_45_T5GR_POSN                     equ 0000h
RPINR44_45_T5GR_POSITION                 equ 0000h
RPINR44_45_T5GR_SIZE                     equ 0004h
RPINR44_45_T5GR_LENGTH                   equ 0004h
RPINR44_45_T5GR_MASK                     equ 000Fh
RPINR44_45_T5CKIR_POSN                   equ 0004h
RPINR44_45_T5CKIR_POSITION               equ 0004h
RPINR44_45_T5CKIR_SIZE                   equ 0004h
RPINR44_45_T5CKIR_LENGTH                 equ 0004h
RPINR44_45_T5CKIR_MASK                   equ 00F0h
RPINR44_45_T5GR0_POSN                    equ 0000h
RPINR44_45_T5GR0_POSITION                equ 0000h
RPINR44_45_T5GR0_SIZE                    equ 0001h
RPINR44_45_T5GR0_LENGTH                  equ 0001h
RPINR44_45_T5GR0_MASK                    equ 0001h
RPINR44_45_T5GR1_POSN                    equ 0001h
RPINR44_45_T5GR1_POSITION                equ 0001h
RPINR44_45_T5GR1_SIZE                    equ 0001h
RPINR44_45_T5GR1_LENGTH                  equ 0001h
RPINR44_45_T5GR1_MASK                    equ 0002h
RPINR44_45_T5GR2_POSN                    equ 0002h
RPINR44_45_T5GR2_POSITION                equ 0002h
RPINR44_45_T5GR2_SIZE                    equ 0001h
RPINR44_45_T5GR2_LENGTH                  equ 0001h
RPINR44_45_T5GR2_MASK                    equ 0004h
RPINR44_45_T5GR3_POSN                    equ 0003h
RPINR44_45_T5GR3_POSITION                equ 0003h
RPINR44_45_T5GR3_SIZE                    equ 0001h
RPINR44_45_T5GR3_LENGTH                  equ 0001h
RPINR44_45_T5GR3_MASK                    equ 0008h
RPINR44_45_T5CKIR0_POSN                  equ 0004h
RPINR44_45_T5CKIR0_POSITION              equ 0004h
RPINR44_45_T5CKIR0_SIZE                  equ 0001h
RPINR44_45_T5CKIR0_LENGTH                equ 0001h
RPINR44_45_T5CKIR0_MASK                  equ 0010h
RPINR44_45_T5CKIR1_POSN                  equ 0005h
RPINR44_45_T5CKIR1_POSITION              equ 0005h
RPINR44_45_T5CKIR1_SIZE                  equ 0001h
RPINR44_45_T5CKIR1_LENGTH                equ 0001h
RPINR44_45_T5CKIR1_MASK                  equ 0020h
RPINR44_45_T5CKIR2_POSN                  equ 0006h
RPINR44_45_T5CKIR2_POSITION              equ 0006h
RPINR44_45_T5CKIR2_SIZE                  equ 0001h
RPINR44_45_T5CKIR2_LENGTH                equ 0001h
RPINR44_45_T5CKIR2_MASK                  equ 0040h
RPINR44_45_T5CKIR3_POSN                  equ 0007h
RPINR44_45_T5CKIR3_POSITION              equ 0007h
RPINR44_45_T5CKIR3_SIZE                  equ 0001h
RPINR44_45_T5CKIR3_LENGTH                equ 0001h
RPINR44_45_T5CKIR3_MASK                  equ 0080h

// Register: RPINR46_47
#define RPINR46_47 RPINR46_47
RPINR46_47                               equ 0E41h
// bitfield definitions
RPINR46_47_PBIO0R_POSN                   equ 0000h
RPINR46_47_PBIO0R_POSITION               equ 0000h
RPINR46_47_PBIO0R_SIZE                   equ 0004h
RPINR46_47_PBIO0R_LENGTH                 equ 0004h
RPINR46_47_PBIO0R_MASK                   equ 000Fh
RPINR46_47_PBIO1R_POSN                   equ 0004h
RPINR46_47_PBIO1R_POSITION               equ 0004h
RPINR46_47_PBIO1R_SIZE                   equ 0004h
RPINR46_47_PBIO1R_LENGTH                 equ 0004h
RPINR46_47_PBIO1R_MASK                   equ 00F0h
RPINR46_47_PBIO0R0_POSN                  equ 0000h
RPINR46_47_PBIO0R0_POSITION              equ 0000h
RPINR46_47_PBIO0R0_SIZE                  equ 0001h
RPINR46_47_PBIO0R0_LENGTH                equ 0001h
RPINR46_47_PBIO0R0_MASK                  equ 0001h
RPINR46_47_PBIO0R1_POSN                  equ 0001h
RPINR46_47_PBIO0R1_POSITION              equ 0001h
RPINR46_47_PBIO0R1_SIZE                  equ 0001h
RPINR46_47_PBIO0R1_LENGTH                equ 0001h
RPINR46_47_PBIO0R1_MASK                  equ 0002h
RPINR46_47_PBIO0R2_POSN                  equ 0002h
RPINR46_47_PBIO0R2_POSITION              equ 0002h
RPINR46_47_PBIO0R2_SIZE                  equ 0001h
RPINR46_47_PBIO0R2_LENGTH                equ 0001h
RPINR46_47_PBIO0R2_MASK                  equ 0004h
RPINR46_47_PBIO0R3_POSN                  equ 0003h
RPINR46_47_PBIO0R3_POSITION              equ 0003h
RPINR46_47_PBIO0R3_SIZE                  equ 0001h
RPINR46_47_PBIO0R3_LENGTH                equ 0001h
RPINR46_47_PBIO0R3_MASK                  equ 0008h
RPINR46_47_PBIO1R0_POSN                  equ 0004h
RPINR46_47_PBIO1R0_POSITION              equ 0004h
RPINR46_47_PBIO1R0_SIZE                  equ 0001h
RPINR46_47_PBIO1R0_LENGTH                equ 0001h
RPINR46_47_PBIO1R0_MASK                  equ 0010h
RPINR46_47_PBIO1R1_POSN                  equ 0005h
RPINR46_47_PBIO1R1_POSITION              equ 0005h
RPINR46_47_PBIO1R1_SIZE                  equ 0001h
RPINR46_47_PBIO1R1_LENGTH                equ 0001h
RPINR46_47_PBIO1R1_MASK                  equ 0020h
RPINR46_47_PBIO1R2_POSN                  equ 0006h
RPINR46_47_PBIO1R2_POSITION              equ 0006h
RPINR46_47_PBIO1R2_SIZE                  equ 0001h
RPINR46_47_PBIO1R2_LENGTH                equ 0001h
RPINR46_47_PBIO1R2_MASK                  equ 0040h
RPINR46_47_PBIO1R3_POSN                  equ 0007h
RPINR46_47_PBIO1R3_POSITION              equ 0007h
RPINR46_47_PBIO1R3_SIZE                  equ 0001h
RPINR46_47_PBIO1R3_LENGTH                equ 0001h
RPINR46_47_PBIO1R3_MASK                  equ 0080h

// Register: RPINR48_49
#define RPINR48_49 RPINR48_49
RPINR48_49                               equ 0E42h
// bitfield definitions
RPINR48_49_PBIO2R_POSN                   equ 0000h
RPINR48_49_PBIO2R_POSITION               equ 0000h
RPINR48_49_PBIO2R_SIZE                   equ 0004h
RPINR48_49_PBIO2R_LENGTH                 equ 0004h
RPINR48_49_PBIO2R_MASK                   equ 000Fh
RPINR48_49_PBIO3R_POSN                   equ 0004h
RPINR48_49_PBIO3R_POSITION               equ 0004h
RPINR48_49_PBIO3R_SIZE                   equ 0004h
RPINR48_49_PBIO3R_LENGTH                 equ 0004h
RPINR48_49_PBIO3R_MASK                   equ 00F0h
RPINR48_49_PBIO2R0_POSN                  equ 0000h
RPINR48_49_PBIO2R0_POSITION              equ 0000h
RPINR48_49_PBIO2R0_SIZE                  equ 0001h
RPINR48_49_PBIO2R0_LENGTH                equ 0001h
RPINR48_49_PBIO2R0_MASK                  equ 0001h
RPINR48_49_PBIO2R1_POSN                  equ 0001h
RPINR48_49_PBIO2R1_POSITION              equ 0001h
RPINR48_49_PBIO2R1_SIZE                  equ 0001h
RPINR48_49_PBIO2R1_LENGTH                equ 0001h
RPINR48_49_PBIO2R1_MASK                  equ 0002h
RPINR48_49_PBIO2R2_POSN                  equ 0002h
RPINR48_49_PBIO2R2_POSITION              equ 0002h
RPINR48_49_PBIO2R2_SIZE                  equ 0001h
RPINR48_49_PBIO2R2_LENGTH                equ 0001h
RPINR48_49_PBIO2R2_MASK                  equ 0004h
RPINR48_49_PBIO2R3_POSN                  equ 0003h
RPINR48_49_PBIO2R3_POSITION              equ 0003h
RPINR48_49_PBIO2R3_SIZE                  equ 0001h
RPINR48_49_PBIO2R3_LENGTH                equ 0001h
RPINR48_49_PBIO2R3_MASK                  equ 0008h
RPINR48_49_PBIO3R0_POSN                  equ 0004h
RPINR48_49_PBIO3R0_POSITION              equ 0004h
RPINR48_49_PBIO3R0_SIZE                  equ 0001h
RPINR48_49_PBIO3R0_LENGTH                equ 0001h
RPINR48_49_PBIO3R0_MASK                  equ 0010h
RPINR48_49_PBIO3R1_POSN                  equ 0005h
RPINR48_49_PBIO3R1_POSITION              equ 0005h
RPINR48_49_PBIO3R1_SIZE                  equ 0001h
RPINR48_49_PBIO3R1_LENGTH                equ 0001h
RPINR48_49_PBIO3R1_MASK                  equ 0020h
RPINR48_49_PBIO3R2_POSN                  equ 0006h
RPINR48_49_PBIO3R2_POSITION              equ 0006h
RPINR48_49_PBIO3R2_SIZE                  equ 0001h
RPINR48_49_PBIO3R2_LENGTH                equ 0001h
RPINR48_49_PBIO3R2_MASK                  equ 0040h
RPINR48_49_PBIO3R3_POSN                  equ 0007h
RPINR48_49_PBIO3R3_POSITION              equ 0007h
RPINR48_49_PBIO3R3_SIZE                  equ 0001h
RPINR48_49_PBIO3R3_LENGTH                equ 0001h
RPINR48_49_PBIO3R3_MASK                  equ 0080h

// Register: RPINR50_51
#define RPINR50_51 RPINR50_51
RPINR50_51                               equ 0E43h
// bitfield definitions
RPINR50_51_PBIO4R_POSN                   equ 0000h
RPINR50_51_PBIO4R_POSITION               equ 0000h
RPINR50_51_PBIO4R_SIZE                   equ 0004h
RPINR50_51_PBIO4R_LENGTH                 equ 0004h
RPINR50_51_PBIO4R_MASK                   equ 000Fh
RPINR50_51_PBIO5R_POSN                   equ 0004h
RPINR50_51_PBIO5R_POSITION               equ 0004h
RPINR50_51_PBIO5R_SIZE                   equ 0004h
RPINR50_51_PBIO5R_LENGTH                 equ 0004h
RPINR50_51_PBIO5R_MASK                   equ 00F0h
RPINR50_51_PBIO4R0_POSN                  equ 0000h
RPINR50_51_PBIO4R0_POSITION              equ 0000h
RPINR50_51_PBIO4R0_SIZE                  equ 0001h
RPINR50_51_PBIO4R0_LENGTH                equ 0001h
RPINR50_51_PBIO4R0_MASK                  equ 0001h
RPINR50_51_PBIO4R1_POSN                  equ 0001h
RPINR50_51_PBIO4R1_POSITION              equ 0001h
RPINR50_51_PBIO4R1_SIZE                  equ 0001h
RPINR50_51_PBIO4R1_LENGTH                equ 0001h
RPINR50_51_PBIO4R1_MASK                  equ 0002h
RPINR50_51_PBIO4R2_POSN                  equ 0002h
RPINR50_51_PBIO4R2_POSITION              equ 0002h
RPINR50_51_PBIO4R2_SIZE                  equ 0001h
RPINR50_51_PBIO4R2_LENGTH                equ 0001h
RPINR50_51_PBIO4R2_MASK                  equ 0004h
RPINR50_51_PBIO4R3_POSN                  equ 0003h
RPINR50_51_PBIO4R3_POSITION              equ 0003h
RPINR50_51_PBIO4R3_SIZE                  equ 0001h
RPINR50_51_PBIO4R3_LENGTH                equ 0001h
RPINR50_51_PBIO4R3_MASK                  equ 0008h
RPINR50_51_PBIO5R0_POSN                  equ 0004h
RPINR50_51_PBIO5R0_POSITION              equ 0004h
RPINR50_51_PBIO5R0_SIZE                  equ 0001h
RPINR50_51_PBIO5R0_LENGTH                equ 0001h
RPINR50_51_PBIO5R0_MASK                  equ 0010h
RPINR50_51_PBIO5R1_POSN                  equ 0005h
RPINR50_51_PBIO5R1_POSITION              equ 0005h
RPINR50_51_PBIO5R1_SIZE                  equ 0001h
RPINR50_51_PBIO5R1_LENGTH                equ 0001h
RPINR50_51_PBIO5R1_MASK                  equ 0020h
RPINR50_51_PBIO5R2_POSN                  equ 0006h
RPINR50_51_PBIO5R2_POSITION              equ 0006h
RPINR50_51_PBIO5R2_SIZE                  equ 0001h
RPINR50_51_PBIO5R2_LENGTH                equ 0001h
RPINR50_51_PBIO5R2_MASK                  equ 0040h
RPINR50_51_PBIO5R3_POSN                  equ 0007h
RPINR50_51_PBIO5R3_POSITION              equ 0007h
RPINR50_51_PBIO5R3_SIZE                  equ 0001h
RPINR50_51_PBIO5R3_LENGTH                equ 0001h
RPINR50_51_PBIO5R3_MASK                  equ 0080h

