GopalSaraf/Practicals/PSDL/include/proc/pic18f86j94.inc
// Register: ADCBUF23L
#define ADCBUF23L ADCBUF23L
ADCBUF23L                                equ 0E74h
// bitfield definitions
ADCBUF23L_ADCBUF23L_POSN                 equ 0000h
ADCBUF23L_ADCBUF23L_POSITION             equ 0000h
ADCBUF23L_ADCBUF23L_SIZE                 equ 0008h
ADCBUF23L_ADCBUF23L_LENGTH               equ 0008h
ADCBUF23L_ADCBUF23L_MASK                 equ 00FFh

// Register: ADCBUF23H
#define ADCBUF23H ADCBUF23H
ADCBUF23H                                equ 0E75h
// bitfield definitions
ADCBUF23H_ADCBUF23H_POSN                 equ 0000h
ADCBUF23H_ADCBUF23H_POSITION             equ 0000h
ADCBUF23H_ADCBUF23H_SIZE                 equ 0008h
ADCBUF23H_ADCBUF23H_LENGTH               equ 0008h
ADCBUF23H_ADCBUF23H_MASK                 equ 00FFh

// Register: ADCBUF24
#define ADCBUF24 ADCBUF24
ADCBUF24                                 equ 0E76h

// Register: ADCBUF24L
#define ADCBUF24L ADCBUF24L
ADCBUF24L                                equ 0E76h
// bitfield definitions
ADCBUF24L_ADCBUF24L_POSN                 equ 0000h
ADCBUF24L_ADCBUF24L_POSITION             equ 0000h
ADCBUF24L_ADCBUF24L_SIZE                 equ 0008h
ADCBUF24L_ADCBUF24L_LENGTH               equ 0008h
ADCBUF24L_ADCBUF24L_MASK                 equ 00FFh

// Register: ADCBUF24H
#define ADCBUF24H ADCBUF24H
ADCBUF24H                                equ 0E77h
// bitfield definitions
ADCBUF24H_ADCBUF24H_POSN                 equ 0000h
ADCBUF24H_ADCBUF24H_POSITION             equ 0000h
ADCBUF24H_ADCBUF24H_SIZE                 equ 0008h
ADCBUF24H_ADCBUF24H_LENGTH               equ 0008h
ADCBUF24H_ADCBUF24H_MASK                 equ 00FFh

// Register: ADCBUF25
#define ADCBUF25 ADCBUF25
ADCBUF25                                 equ 0E78h

// Register: ADCBUF25L
#define ADCBUF25L ADCBUF25L
ADCBUF25L                                equ 0E78h
// bitfield definitions
ADCBUF25L_ADCBUF25L_POSN                 equ 0000h
ADCBUF25L_ADCBUF25L_POSITION             equ 0000h
ADCBUF25L_ADCBUF25L_SIZE                 equ 0008h
ADCBUF25L_ADCBUF25L_LENGTH               equ 0008h
ADCBUF25L_ADCBUF25L_MASK                 equ 00FFh

// Register: ADCBUF25H
#define ADCBUF25H ADCBUF25H
ADCBUF25H                                equ 0E79h
// bitfield definitions
ADCBUF25H_ADCBUF25H_POSN                 equ 0000h
ADCBUF25H_ADCBUF25H_POSITION             equ 0000h
ADCBUF25H_ADCBUF25H_SIZE                 equ 0008h
ADCBUF25H_ADCBUF25H_LENGTH               equ 0008h
ADCBUF25H_ADCBUF25H_MASK                 equ 00FFh

// Register: ADCTMUEN0L
#define ADCTMUEN0L ADCTMUEN0L
ADCTMUEN0L                               equ 0E7Ah
// bitfield definitions
ADCTMUEN0L_CTMUEN_POSN                   equ 0000h
ADCTMUEN0L_CTMUEN_POSITION               equ 0000h
ADCTMUEN0L_CTMUEN_SIZE                   equ 0008h
ADCTMUEN0L_CTMUEN_LENGTH                 equ 0008h
ADCTMUEN0L_CTMUEN_MASK                   equ 00FFh
ADCTMUEN0L_CTMUEN0_POSN                  equ 0000h
ADCTMUEN0L_CTMUEN0_POSITION              equ 0000h
ADCTMUEN0L_CTMUEN0_SIZE                  equ 0001h
ADCTMUEN0L_CTMUEN0_LENGTH                equ 0001h
ADCTMUEN0L_CTMUEN0_MASK                  equ 0001h
ADCTMUEN0L_CTMUEN1_POSN                  equ 0001h
ADCTMUEN0L_CTMUEN1_POSITION              equ 0001h
ADCTMUEN0L_CTMUEN1_SIZE                  equ 0001h
ADCTMUEN0L_CTMUEN1_LENGTH                equ 0001h
ADCTMUEN0L_CTMUEN1_MASK                  equ 0002h
ADCTMUEN0L_CTMUEN2_POSN                  equ 0002h
ADCTMUEN0L_CTMUEN2_POSITION              equ 0002h
ADCTMUEN0L_CTMUEN2_SIZE                  equ 0001h
ADCTMUEN0L_CTMUEN2_LENGTH                equ 0001h
ADCTMUEN0L_CTMUEN2_MASK                  equ 0004h
ADCTMUEN0L_CTMUEN3_POSN                  equ 0003h
ADCTMUEN0L_CTMUEN3_POSITION              equ 0003h
ADCTMUEN0L_CTMUEN3_SIZE                  equ 0001h
ADCTMUEN0L_CTMUEN3_LENGTH                equ 0001h
ADCTMUEN0L_CTMUEN3_MASK                  equ 0008h
ADCTMUEN0L_CTMUEN4_POSN                  equ 0004h
ADCTMUEN0L_CTMUEN4_POSITION              equ 0004h
ADCTMUEN0L_CTMUEN4_SIZE                  equ 0001h
ADCTMUEN0L_CTMUEN4_LENGTH                equ 0001h
ADCTMUEN0L_CTMUEN4_MASK                  equ 0010h
ADCTMUEN0L_CTMUEN5_POSN                  equ 0005h
ADCTMUEN0L_CTMUEN5_POSITION              equ 0005h
ADCTMUEN0L_CTMUEN5_SIZE                  equ 0001h
ADCTMUEN0L_CTMUEN5_LENGTH                equ 0001h
ADCTMUEN0L_CTMUEN5_MASK                  equ 0020h
ADCTMUEN0L_CTMUEN6_POSN                  equ 0006h
ADCTMUEN0L_CTMUEN6_POSITION              equ 0006h
ADCTMUEN0L_CTMUEN6_SIZE                  equ 0001h
ADCTMUEN0L_CTMUEN6_LENGTH                equ 0001h
ADCTMUEN0L_CTMUEN6_MASK                  equ 0040h
ADCTMUEN0L_CTMUEN7_POSN                  equ 0007h
ADCTMUEN0L_CTMUEN7_POSITION              equ 0007h
ADCTMUEN0L_CTMUEN7_SIZE                  equ 0001h
ADCTMUEN0L_CTMUEN7_LENGTH                equ 0001h
ADCTMUEN0L_CTMUEN7_MASK                  equ 0080h

// Register: ADCTMUEN0H
#define ADCTMUEN0H ADCTMUEN0H
ADCTMUEN0H                               equ 0E7Bh
// bitfield definitions
ADCTMUEN0H_CTMUEN_POSN                   equ 0000h
ADCTMUEN0H_CTMUEN_POSITION               equ 0000h
ADCTMUEN0H_CTMUEN_SIZE                   equ 0008h
ADCTMUEN0H_CTMUEN_LENGTH                 equ 0008h
ADCTMUEN0H_CTMUEN_MASK                   equ 00FFh
ADCTMUEN0H_CTMUEN8_POSN                  equ 0000h
ADCTMUEN0H_CTMUEN8_POSITION              equ 0000h
ADCTMUEN0H_CTMUEN8_SIZE                  equ 0001h
ADCTMUEN0H_CTMUEN8_LENGTH                equ 0001h
ADCTMUEN0H_CTMUEN8_MASK                  equ 0001h
ADCTMUEN0H_CTMUEN9_POSN                  equ 0001h
ADCTMUEN0H_CTMUEN9_POSITION              equ 0001h
ADCTMUEN0H_CTMUEN9_SIZE                  equ 0001h
ADCTMUEN0H_CTMUEN9_LENGTH                equ 0001h
ADCTMUEN0H_CTMUEN9_MASK                  equ 0002h
ADCTMUEN0H_CTMUEN10_POSN                 equ 0002h
ADCTMUEN0H_CTMUEN10_POSITION             equ 0002h
ADCTMUEN0H_CTMUEN10_SIZE                 equ 0001h
ADCTMUEN0H_CTMUEN10_LENGTH               equ 0001h
ADCTMUEN0H_CTMUEN10_MASK                 equ 0004h
ADCTMUEN0H_CTMUEN11_POSN                 equ 0003h
ADCTMUEN0H_CTMUEN11_POSITION             equ 0003h
ADCTMUEN0H_CTMUEN11_SIZE                 equ 0001h
ADCTMUEN0H_CTMUEN11_LENGTH               equ 0001h
ADCTMUEN0H_CTMUEN11_MASK                 equ 0008h
ADCTMUEN0H_CTMUEN12_POSN                 equ 0004h
ADCTMUEN0H_CTMUEN12_POSITION             equ 0004h
ADCTMUEN0H_CTMUEN12_SIZE                 equ 0001h
ADCTMUEN0H_CTMUEN12_LENGTH               equ 0001h
ADCTMUEN0H_CTMUEN12_MASK                 equ 0010h
ADCTMUEN0H_CTMUEN13_POSN                 equ 0005h
ADCTMUEN0H_CTMUEN13_POSITION             equ 0005h
ADCTMUEN0H_CTMUEN13_SIZE                 equ 0001h
ADCTMUEN0H_CTMUEN13_LENGTH               equ 0001h
ADCTMUEN0H_CTMUEN13_MASK                 equ 0020h
ADCTMUEN0H_CTMUEN14_POSN                 equ 0006h
ADCTMUEN0H_CTMUEN14_POSITION             equ 0006h
ADCTMUEN0H_CTMUEN14_SIZE                 equ 0001h
ADCTMUEN0H_CTMUEN14_LENGTH               equ 0001h
ADCTMUEN0H_CTMUEN14_MASK                 equ 0040h
ADCTMUEN0H_CTMUEN15_POSN                 equ 0007h
ADCTMUEN0H_CTMUEN15_POSITION             equ 0007h
ADCTMUEN0H_CTMUEN15_SIZE                 equ 0001h
ADCTMUEN0H_CTMUEN15_LENGTH               equ 0001h
ADCTMUEN0H_CTMUEN15_MASK                 equ 0080h

// Register: ADCTMUEN1L
#define ADCTMUEN1L ADCTMUEN1L
ADCTMUEN1L                               equ 0E7Ch
// bitfield definitions
ADCTMUEN1L_CTMUEN_POSN                   equ 0000h
ADCTMUEN1L_CTMUEN_POSITION               equ 0000h
ADCTMUEN1L_CTMUEN_SIZE                   equ 0008h
ADCTMUEN1L_CTMUEN_LENGTH                 equ 0008h
ADCTMUEN1L_CTMUEN_MASK                   equ 00FFh
ADCTMUEN1L_CTUMEN16_POSN                 equ 0000h
ADCTMUEN1L_CTUMEN16_POSITION             equ 0000h
ADCTMUEN1L_CTUMEN16_SIZE                 equ 0001h
ADCTMUEN1L_CTUMEN16_LENGTH               equ 0001h
ADCTMUEN1L_CTUMEN16_MASK                 equ 0001h
ADCTMUEN1L_CTUMEN17_POSN                 equ 0001h
ADCTMUEN1L_CTUMEN17_POSITION             equ 0001h
ADCTMUEN1L_CTUMEN17_SIZE                 equ 0001h
ADCTMUEN1L_CTUMEN17_LENGTH               equ 0001h
ADCTMUEN1L_CTUMEN17_MASK                 equ 0002h
ADCTMUEN1L_CTUMEN18_POSN                 equ 0002h
ADCTMUEN1L_CTUMEN18_POSITION             equ 0002h
ADCTMUEN1L_CTUMEN18_SIZE                 equ 0001h
ADCTMUEN1L_CTUMEN18_LENGTH               equ 0001h
ADCTMUEN1L_CTUMEN18_MASK                 equ 0004h
ADCTMUEN1L_CTUMEN19_POSN                 equ 0003h
ADCTMUEN1L_CTUMEN19_POSITION             equ 0003h
ADCTMUEN1L_CTUMEN19_SIZE                 equ 0001h
ADCTMUEN1L_CTUMEN19_LENGTH               equ 0001h
ADCTMUEN1L_CTUMEN19_MASK                 equ 0008h
ADCTMUEN1L_CTMUEN20_POSN                 equ 0004h
ADCTMUEN1L_CTMUEN20_POSITION             equ 0004h
ADCTMUEN1L_CTMUEN20_SIZE                 equ 0001h
ADCTMUEN1L_CTMUEN20_LENGTH               equ 0001h
ADCTMUEN1L_CTMUEN20_MASK                 equ 0010h
ADCTMUEN1L_CTMUEN21_POSN                 equ 0005h
ADCTMUEN1L_CTMUEN21_POSITION             equ 0005h
ADCTMUEN1L_CTMUEN21_SIZE                 equ 0001h
ADCTMUEN1L_CTMUEN21_LENGTH               equ 0001h
ADCTMUEN1L_CTMUEN21_MASK                 equ 0020h
ADCTMUEN1L_CTMUEN22_POSN                 equ 0006h
ADCTMUEN1L_CTMUEN22_POSITION             equ 0006h
ADCTMUEN1L_CTMUEN22_SIZE                 equ 0001h
ADCTMUEN1L_CTMUEN22_LENGTH               equ 0001h
ADCTMUEN1L_CTMUEN22_MASK                 equ 0040h
ADCTMUEN1L_CTMUEN23_POSN                 equ 0007h
ADCTMUEN1L_CTMUEN23_POSITION             equ 0007h
ADCTMUEN1L_CTMUEN23_SIZE                 equ 0001h
ADCTMUEN1L_CTMUEN23_LENGTH               equ 0001h
ADCTMUEN1L_CTMUEN23_MASK                 equ 0080h

// Register: ADCTMUEN1H
#define ADCTMUEN1H ADCTMUEN1H
ADCTMUEN1H                               equ 0E7Dh
// bitfield definitions
ADCTMUEN1H_CTMUEN_POSN                   equ 0000h
ADCTMUEN1H_CTMUEN_POSITION               equ 0000h
ADCTMUEN1H_CTMUEN_SIZE                   equ 0008h
ADCTMUEN1H_CTMUEN_LENGTH                 equ 0008h
ADCTMUEN1H_CTMUEN_MASK                   equ 00FFh
ADCTMUEN1H_CTUMEN24_POSN                 equ 0000h
ADCTMUEN1H_CTUMEN24_POSITION             equ 0000h
ADCTMUEN1H_CTUMEN24_SIZE                 equ 0001h
ADCTMUEN1H_CTUMEN24_LENGTH               equ 0001h
ADCTMUEN1H_CTUMEN24_MASK                 equ 0001h
ADCTMUEN1H_CTUMEN25_POSN                 equ 0001h
ADCTMUEN1H_CTUMEN25_POSITION             equ 0001h
ADCTMUEN1H_CTUMEN25_SIZE                 equ 0001h
ADCTMUEN1H_CTUMEN25_LENGTH               equ 0001h
ADCTMUEN1H_CTUMEN25_MASK                 equ 0002h
ADCTMUEN1H_CTUMEN26_POSN                 equ 0002h
ADCTMUEN1H_CTUMEN26_POSITION             equ 0002h
ADCTMUEN1H_CTUMEN26_SIZE                 equ 0001h
ADCTMUEN1H_CTUMEN26_LENGTH               equ 0001h
ADCTMUEN1H_CTUMEN26_MASK                 equ 0004h
ADCTMUEN1H_CTUMEN27_POSN                 equ 0003h
ADCTMUEN1H_CTUMEN27_POSITION             equ 0003h
ADCTMUEN1H_CTUMEN27_SIZE                 equ 0001h
ADCTMUEN1H_CTUMEN27_LENGTH               equ 0001h
ADCTMUEN1H_CTUMEN27_MASK                 equ 0008h
ADCTMUEN1H_CTUMEN28_POSN                 equ 0004h
ADCTMUEN1H_CTUMEN28_POSITION             equ 0004h
ADCTMUEN1H_CTUMEN28_SIZE                 equ 0001h
ADCTMUEN1H_CTUMEN28_LENGTH               equ 0001h
ADCTMUEN1H_CTUMEN28_MASK                 equ 0010h
ADCTMUEN1H_CTUMEN29_POSN                 equ 0005h
ADCTMUEN1H_CTUMEN29_POSITION             equ 0005h
ADCTMUEN1H_CTUMEN29_SIZE                 equ 0001h
ADCTMUEN1H_CTUMEN29_LENGTH               equ 0001h
ADCTMUEN1H_CTUMEN29_MASK                 equ 0020h
ADCTMUEN1H_CTMUEN30_POSN                 equ 0006h
ADCTMUEN1H_CTMUEN30_POSITION             equ 0006h
ADCTMUEN1H_CTMUEN30_SIZE                 equ 0001h
ADCTMUEN1H_CTMUEN30_LENGTH               equ 0001h
ADCTMUEN1H_CTMUEN30_MASK                 equ 0040h

