GopalSaraf/Practicals/PSDL/include/proc/pic18f86j94.inc
#define LG1                              BANKMASK(LATG), 1, a
#define LG2                              BANKMASK(LATG), 2, a
#define LG3                              BANKMASK(LATG), 3, a
#define LG4                              BANKMASK(LATG), 4, a
#define LH0                              BANKMASK(LATH), 0, a
#define LH1                              BANKMASK(LATH), 1, a
#define LH2                              BANKMASK(LATH), 2, a
#define LH3                              BANKMASK(LATH), 3, a
#define LH4                              BANKMASK(LATH), 4, a
#define LH5                              BANKMASK(LATH), 5, a
#define LH6                              BANKMASK(LATH), 6, a
#define LH7                              BANKMASK(LATH), 7, a
#define LJ0                              BANKMASK(LATJ), 0, a
#define LJ1                              BANKMASK(LATJ), 1, a
#define LJ2                              BANKMASK(LATJ), 2, a
#define LJ3                              BANKMASK(LATJ), 3, a
#define LJ4                              BANKMASK(LATJ), 4, a
#define LJ5                              BANKMASK(LATJ), 5, a
#define LJ6                              BANKMASK(LATJ), 6, a
#define LJ7                              BANKMASK(LATJ), 7, a
#define LMUX0                            BANKMASK(LCDCON), 0, b
#define LMUX1                            BANKMASK(LCDCON), 1, b
#define LMUX2                            BANKMASK(LCDCON), 2, b
#define LOCK                             BANKMASK(OSCCON2), 5, a
#define LP0                              BANKMASK(LCDPS), 0, b
#define LP1                              BANKMASK(LCDPS), 1, b
#define LP2                              BANKMASK(LCDPS), 2, b
#define LP3                              BANKMASK(LCDPS), 3, b
#define LPENA                            BANKMASK(ADCON5H), 6, b
#define LRLAP0                           BANKMASK(LCDRL), 6, b
#define LRLAP1                           BANKMASK(LCDRL), 7, b
#define LRLAT0                           BANKMASK(LCDRL), 0, b
#define LRLAT1                           BANKMASK(LCDRL), 1, b
#define LRLAT2                           BANKMASK(LCDRL), 2, b
#define LRLBP0                           BANKMASK(LCDRL), 4, b
#define LRLBP1                           BANKMASK(LCDRL), 5, b
#define LVDIF                            BANKMASK(PIR2), 2, a
#define LVDIN                            BANKMASK(PORTA), 5, a
#define LVDMD                            BANKMASK(PMD4), 2, b
#define MDBIT                            BANKMASK(MDCON), 0, b
#define MDCH0                            BANKMASK(MDCARH), 0, b
#define MDCH1                            BANKMASK(MDCARH), 1, b
#define MDCH2                            BANKMASK(MDCARH), 2, b
#define MDCH3                            BANKMASK(MDCARH), 3, b
#define MDCHODIS                         BANKMASK(MDCARH), 7, b
#define MDCHPOL                          BANKMASK(MDCARH), 6, b
#define MDCHSYNC                         BANKMASK(MDCARH), 5, b
#define MDCIN1R0                         BANKMASK(RPINR30_31), 0, b
#define MDCIN1R1                         BANKMASK(RPINR30_31), 1, b
#define MDCIN1R2                         BANKMASK(RPINR30_31), 2, b
#define MDCIN1R3                         BANKMASK(RPINR30_31), 3, b
#define MDCIN2R0                         BANKMASK(RPINR30_31), 4, b
#define MDCIN2R1                         BANKMASK(RPINR30_31), 5, b
#define MDCIN2R2                         BANKMASK(RPINR30_31), 6, b
#define MDCIN2R3                         BANKMASK(RPINR30_31), 7, b
#define MDCL0                            BANKMASK(MDCARL), 0, b
#define MDCL1                            BANKMASK(MDCARL), 1, b
#define MDCL2                            BANKMASK(MDCARL), 2, b
#define MDCL3                            BANKMASK(MDCARL), 3, b
#define MDCLODIS                         BANKMASK(MDCARL), 7, b
#define MDCLPOL                          BANKMASK(MDCARL), 6, b
#define MDCLSYNC                         BANKMASK(MDCARL), 5, b
#define MDEN                             BANKMASK(MDCON), 7, b
#define MDMINR0                          BANKMASK(RPINR28_29), 4, b
#define MDMINR1                          BANKMASK(RPINR28_29), 5, b
#define MDMINR2                          BANKMASK(RPINR28_29), 6, b
#define MDMINR3                          BANKMASK(RPINR28_29), 7, b
#define MDO                              BANKMASK(MDCON), 3, b
#define MDOE                             BANKMASK(MDCON), 6, b
#define MDOPOL                           BANKMASK(MDCON), 4, b
#define MDSLR                            BANKMASK(MDCON), 5, b
#define MDSODIS                          BANKMASK(MDSRC), 7, b
#define MDSRC0                           BANKMASK(MDSRC), 0, b
#define MDSRC1                           BANKMASK(MDSRC), 1, b
#define MDSRC2                           BANKMASK(MDSRC), 2, b
#define MDSRC3                           BANKMASK(MDSRC), 3, b
#define MODE12                           BANKMASK(ADCON1H), 2, a
#define MODE13                           BANKMASK(LCDREG), 2, b
#define MODMD                            BANKMASK(PMD3), 7, b
#define MSK01                            BANKMASK(SSP1ADD), 0, a
#define MSK02                            BANKMASK(SSP2ADD), 0, b
#define MSK11                            BANKMASK(SSP1ADD), 1, a
#define MSK12                            BANKMASK(SSP2ADD), 1, b
#define MSK21                            BANKMASK(SSP1ADD), 2, a
#define MSK22                            BANKMASK(SSP2ADD), 2, b
#define MSK31                            BANKMASK(SSP1ADD), 3, a
#define MSK32                            BANKMASK(SSP2ADD), 3, b
#define MSK41                            BANKMASK(SSP1ADD), 4, a
#define MSK42                            BANKMASK(SSP2ADD), 4, b
#define MSK51                            BANKMASK(SSP1ADD), 5, a
#define MSK52                            BANKMASK(SSP2ADD), 5, b
#define MSK61                            BANKMASK(SSP1ADD), 6, a
#define MSK62                            BANKMASK(SSP2ADD), 6, b
#define MSK71                            BANKMASK(SSP1ADD), 7, a
#define MSK72                            BANKMASK(SSP2ADD), 7, b
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOSC0                            BANKMASK(OSCCON), 0, a
#define NOSC1                            BANKMASK(OSCCON), 1, a
#define NOSC2                            BANKMASK(OSCCON), 2, a
#define NOT_ADDRESS1                     BANKMASK(SSP1STAT), 5, a
#define NOT_ADDRESS2                     BANKMASK(SSP2STAT), 5, b
#define NOT_BOR                          BANKMASK(RCON), 0, a
#define NOT_CM                           BANKMASK(RCON), 5, a
#define NOT_PD                           BANKMASK(RCON), 2, a
#define NOT_POR                          BANKMASK(RCON), 1, a
#define NOT_RBPU                         BANKMASK(INTCON2), 7, a
#define NOT_RI                           BANKMASK(RCON), 4, a
#define NOT_T1DONE                       BANKMASK(T1GCON), 3, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3DONE                       BANKMASK(T3GCON), 3, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_T5DONE                       BANKMASK(T5GCON), 3, b
#define NOT_T5SYNC                       BANKMASK(T5CON), 2, b
#define NOT_TO                           BANKMASK(RCON), 3, a
#define NOT_WRITE1                       BANKMASK(SSP1STAT), 2, a
#define NOT_WRITE2                       BANKMASK(SSP2STAT), 2, b
#define NVCFG0                           BANKMASK(ADCON2H), 5, b
#define OBF                              BANKMASK(PSPCON), 6, a
#define OFFCAL                           BANKMASK(ADCON2H), 4, b
#define OSCFIE                           BANKMASK(PIE2), 7, a
#define OSCFIF                           BANKMASK(PIR2), 7, a
#define OSCFIP                           BANKMASK(IPR2), 7, a
#define OV                               BANKMASK(STATUS), 3, a
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define P1DC0                            BANKMASK(ECCP1DEL), 0, a
#define P1DC02                           BANKMASK(PSTR1CON), 0, a
#define P1DC0CON                         BANKMASK(PSTR1CON), 0, a
#define P1DC1                            BANKMASK(ECCP1DEL), 1, a
#define P1DC12                           BANKMASK(PSTR1CON), 1, a
#define P1DC1CON                         BANKMASK(PSTR1CON), 1, a
#define P1DC2                            BANKMASK(ECCP1DEL), 2, a
#define P1DC22                           BANKMASK(PSTR1CON), 2, a
#define P1DC2CON                         BANKMASK(PSTR1CON), 2, a
#define P1DC3                            BANKMASK(ECCP1DEL), 3, a
#define P1DC32                           BANKMASK(PSTR1CON), 3, a
#define P1DC3CON                         BANKMASK(PSTR1CON), 3, a
#define P1DC4                            BANKMASK(ECCP1DEL), 4, a
#define P1DC42                           BANKMASK(PSTR1CON), 4, a
#define P1DC4CON                         BANKMASK(PSTR1CON), 4, a
#define P1DC5                            BANKMASK(ECCP1DEL), 5, a
#define P1DC6                            BANKMASK(ECCP1DEL), 6, a
#define P1DC62                           BANKMASK(PSTR1CON), 6, a
#define P1DC6CON                         BANKMASK(PSTR1CON), 6, a
#define P1M0                             BANKMASK(CCP1CON), 6, a
#define P1M1                             BANKMASK(CCP1CON), 7, a
#define P1RSEN                           BANKMASK(ECCP1DEL), 7, a
#define P2DC0                            BANKMASK(ECCP2DEL), 0, b
#define P2DC02                           BANKMASK(PSTR2CON), 0, b
#define P2DC0CON                         BANKMASK(PSTR2CON), 0, b
#define P2DC1                            BANKMASK(ECCP2DEL), 1, b
#define P2DC12                           BANKMASK(PSTR2CON), 1, b
#define P2DC1CON                         BANKMASK(PSTR2CON), 1, b
#define P2DC2                            BANKMASK(ECCP2DEL), 2, b
#define P2DC22                           BANKMASK(PSTR2CON), 2, b
#define P2DC2CON                         BANKMASK(PSTR2CON), 2, b
#define P2DC3                            BANKMASK(ECCP2DEL), 3, b
#define P2DC32                           BANKMASK(PSTR2CON), 3, b
#define P2DC3CON                         BANKMASK(PSTR2CON), 3, b
#define P2DC4                            BANKMASK(ECCP2DEL), 4, b
#define P2DC42                           BANKMASK(PSTR2CON), 4, b
#define P2DC4CON                         BANKMASK(PSTR2CON), 4, b
#define P2DC5                            BANKMASK(ECCP2DEL), 5, b
#define P2DC6                            BANKMASK(ECCP2DEL), 6, b
#define P2DC62                           BANKMASK(PSTR2CON), 6, b
#define P2DC6CON                         BANKMASK(PSTR2CON), 6, b
#define P2M0                             BANKMASK(CCP2CON), 6, b
#define P2M1                             BANKMASK(CCP2CON), 7, b
#define P2RSEN                           BANKMASK(ECCP2DEL), 7, b
#define P3DC0                            BANKMASK(ECCP3DEL), 0, b
#define P3DC02                           BANKMASK(PSTR3CON), 0, b
#define P3DC0CON                         BANKMASK(PSTR3CON), 0, b
#define P3DC1                            BANKMASK(ECCP3DEL), 1, b
#define P3DC12                           BANKMASK(PSTR3CON), 1, b
#define P3DC1CON                         BANKMASK(PSTR3CON), 1, b
#define P3DC2                            BANKMASK(ECCP3DEL), 2, b
#define P3DC22                           BANKMASK(PSTR3CON), 2, b
#define P3DC2CON                         BANKMASK(PSTR3CON), 2, b
#define P3DC3                            BANKMASK(ECCP3DEL), 3, b
#define P3DC32                           BANKMASK(PSTR3CON), 3, b
#define P3DC3CON                         BANKMASK(PSTR3CON), 3, b
#define P3DC4                            BANKMASK(ECCP3DEL), 4, b
#define P3DC42                           BANKMASK(PSTR3CON), 4, b
#define P3DC4CON                         BANKMASK(PSTR3CON), 4, b
#define P3DC5                            BANKMASK(ECCP3DEL), 5, b
#define P3DC6                            BANKMASK(ECCP3DEL), 6, b
#define P3DC62                           BANKMASK(PSTR3CON), 6, b
#define P3DC6CON                         BANKMASK(PSTR3CON), 6, b
#define P3M0                             BANKMASK(CCP3CON), 6, b
#define P3M1                             BANKMASK(CCP3CON), 7, b
#define P3RSEN                           BANKMASK(ECCP3DEL), 7, b
#define PA1                              BANKMASK(PORTC), 2, a
#define PA2                              BANKMASK(PORTC), 1, a
#define PA2E                             BANKMASK(PORTE), 7, a
#define PB1                              BANKMASK(PORTH), 7, a
#define PB1E                             BANKMASK(PORTE), 6, a
#define PB2                              BANKMASK(PORTE), 2, a
#define PB3                              BANKMASK(PORTH), 5, a
#define PB3E                             BANKMASK(PORTE), 4, a
#define PBIO0R0                          BANKMASK(RPINR46_47), 0, b
#define PBIO0R1                          BANKMASK(RPINR46_47), 1, b
#define PBIO0R2                          BANKMASK(RPINR46_47), 2, b
#define PBIO0R3                          BANKMASK(RPINR46_47), 3, b
#define PBIO1R0                          BANKMASK(RPINR46_47), 4, b
#define PBIO1R1                          BANKMASK(RPINR46_47), 5, b
#define PBIO1R2                          BANKMASK(RPINR46_47), 6, b
#define PBIO1R3                          BANKMASK(RPINR46_47), 7, b
#define PBIO2R0                          BANKMASK(RPINR48_49), 0, b
#define PBIO2R1                          BANKMASK(RPINR48_49), 1, b
#define PBIO2R2                          BANKMASK(RPINR48_49), 2, b
#define PBIO2R3                          BANKMASK(RPINR48_49), 3, b
#define PBIO3R0                          BANKMASK(RPINR48_49), 4, b
#define PBIO3R1                          BANKMASK(RPINR48_49), 5, b
#define PBIO3R2                          BANKMASK(RPINR48_49), 6, b
#define PBIO3R3                          BANKMASK(RPINR48_49), 7, b
#define PBIO4R0                          BANKMASK(RPINR50_51), 0, b
#define PBIO4R1                          BANKMASK(RPINR50_51), 1, b
#define PBIO4R2                          BANKMASK(RPINR50_51), 2, b
#define PBIO4R3                          BANKMASK(RPINR50_51), 3, b
#define PBIO5R0                          BANKMASK(RPINR50_51), 4, b
#define PBIO5R1                          BANKMASK(RPINR50_51), 5, b
#define PBIO5R2                          BANKMASK(RPINR50_51), 6, b
#define PBIO5R3                          BANKMASK(RPINR50_51), 7, b
#define PBIO6R0                          BANKMASK(RPINR52_53), 0, b
#define PBIO6R1                          BANKMASK(RPINR52_53), 1, b
#define PBIO6R2                          BANKMASK(RPINR52_53), 2, b
#define PBIO6R3                          BANKMASK(RPINR52_53), 3, b
#define PBIO7R0                          BANKMASK(RPINR52_53), 4, b
#define PBIO7R1                          BANKMASK(RPINR52_53), 5, b
#define PBIO7R2                          BANKMASK(RPINR52_53), 6, b
#define PBIO7R3                          BANKMASK(RPINR52_53), 7, b
#define PC1                              BANKMASK(PORTH), 6, a
#define PC1E                             BANKMASK(PORTE), 5, a
#define PC2                              BANKMASK(PORTE), 1, a
#define PC3                              BANKMASK(PORTH), 4, a
#define PC3E                             BANKMASK(PORTE), 3, a
#define PCFG10                           BANKMASK(ANCON1), 2, b
#define PCFG11                           BANKMASK(ANCON1), 3, b
#define PCFG12                           BANKMASK(ANCON1), 4, b
#define PCFG13                           BANKMASK(ANCON1), 5, b
#define PCFG14                           BANKMASK(ANCON1), 6, b
#define PCFG15                           BANKMASK(ANCON1), 7, b
#define PCFG16                           BANKMASK(ANCON2), 0, b
#define PCFG17                           BANKMASK(ANCON2), 1, b
#define PCFG18                           BANKMASK(ANCON2), 2, b
#define PCFG19                           BANKMASK(ANCON2), 3, b
#define PCFG20                           BANKMASK(ANCON2), 4, b
#define PCFG21                           BANKMASK(ANCON2), 5, b
#define PCFG22                           BANKMASK(ANCON2), 6, b
#define PCFG23                           BANKMASK(ANCON2), 7, b
#define PCFG8                            BANKMASK(ANCON1), 0, b
#define PCFG9                            BANKMASK(ANCON1), 1, b
#define PD                               BANKMASK(RCON), 2, a
#define PD2                              BANKMASK(PORTE), 0, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PEN1                             BANKMASK(SSP1CON2), 2, a
#define PEN2                             BANKMASK(SSP2CON2), 2, b
#define PIDEE                            BANKMASK(UEIE), 0, b
#define PIDEF                            BANKMASK(UEIR), 0, a
#define PKTDIS                           BANKMASK(UCON), 4, a
#define PLLEN                            BANKMASK(OSCCON4), 5, a
#define PMPTTL                           BANKMASK(PADCFG1), 0, b
#define PMSLP                            BANKMASK(RCON4), 0, a
#define POR                              BANKMASK(RCON), 1, a
#define POSCEN                           BANKMASK(OSCCON2), 2, a
#define PPB0                             BANKMASK(UCFG), 0, b
#define PPB1                             BANKMASK(UCFG), 1, b
#define PPBI                             BANKMASK(USTAT), 1, a
#define PPBRST                           BANKMASK(UCON), 6, a
#define PSA                              BANKMASK(T0CON), 3, a
#define PSPIE                            BANKMASK(PIE1), 7, a
#define PSPIF                            BANKMASK(PIR1), 7, a
#define PSPIP                            BANKMASK(IPR1), 7, a
#define PSPMD                            BANKMASK(PMD3), 2, b
#define PSPMODE                          BANKMASK(PSPCON), 4, a
#define PSS1AC0                          BANKMASK(ECCP1AS), 2, a
#define PSS1AC1                          BANKMASK(ECCP1AS), 3, a
#define PSS1BD0                          BANKMASK(ECCP1AS), 0, a
#define PSS1BD1                          BANKMASK(ECCP1AS), 1, a
#define PSS2AC0                          BANKMASK(ECCP2AS), 2, b
#define PSS2AC1                          BANKMASK(ECCP2AS), 3, b
#define PSS2BD0                          BANKMASK(ECCP2AS), 0, b
#define PSS2BD1                          BANKMASK(ECCP2AS), 1, b
#define PSS3AC0                          BANKMASK(ECCP3AS), 2, b
#define PSS3AC1                          BANKMASK(ECCP3AS), 3, b
#define PSS3BD0                          BANKMASK(ECCP3AS), 0, b
#define PSS3BD1                          BANKMASK(ECCP3AS), 1, b
#define PUMPEN                           BANKMASK(ADCON3H), 5, b
#define PVCFG0                           BANKMASK(ADCON2H), 6, b
#define PVCFG1                           BANKMASK(ADCON2H), 7, b
#define PWCCPRE                          BANKMASK(RTCCON2), 5, b
#define PWCEN                            BANKMASK(RTCCON2), 7, b
#define PWCPOL                           BANKMASK(RTCCON2), 6, b
#define PWCSPRE                          BANKMASK(RTCCON2), 4, b
#define RA0                              BANKMASK(PORTA), 0, a
#define RA1                              BANKMASK(PORTA), 1, a
#define RA2                              BANKMASK(PORTA), 2, a
#define RA3                              BANKMASK(PORTA), 3, a
#define RA4                              BANKMASK(PORTA), 4, a
#define RA5                              BANKMASK(PORTA), 5, a
#define RA6                              BANKMASK(PORTA), 6, a
#define RA7                              BANKMASK(PORTA), 7, a
#define RB0                              BANKMASK(PORTB), 0, a
#define RB1                              BANKMASK(PORTB), 1, a
#define RB2                              BANKMASK(PORTB), 2, a
#define RB3                              BANKMASK(PORTB), 3, a
#define RB4                              BANKMASK(PORTB), 4, a
#define RB5                              BANKMASK(PORTB), 5, a
#define RB6                              BANKMASK(PORTB), 6, a
#define RB7                              BANKMASK(PORTB), 7, a
#define RBPU                             BANKMASK(INTCON2), 7, a
#define RC0                              BANKMASK(PORTC), 0, a
#define RC1                              BANKMASK(PORTC), 1, a
#define RC1IE                            BANKMASK(PIE1), 5, a
#define RC1IF                            BANKMASK(PIR1), 5, a
#define RC1IP                            BANKMASK(IPR1), 5, a
#define RC2                              BANKMASK(PORTC), 2, a
#define RC2IE                            BANKMASK(PIE3), 5, a
#define RC2IF                            BANKMASK(PIR3), 5, a
#define RC2IP                            BANKMASK(IPR3), 5, a
#define RC3                              BANKMASK(PORTC), 3, a
#define RC3IE                            BANKMASK(PIE6), 5, a
#define RC3IF                            BANKMASK(PIR6), 5, a
#define RC3IP                            BANKMASK(IPR6), 5, a
#define RC4                              BANKMASK(PORTC), 4, a
#define RC4IE                            BANKMASK(PIE6), 7, a
#define RC4IF                            BANKMASK(PIR6), 7, a
#define RC4IP                            BANKMASK(IPR6), 7, a
#define RC5                              BANKMASK(PORTC), 5, a
#define RC6                              BANKMASK(PORTC), 6, a
#define RC7                              BANKMASK(PORTC), 7, a
#define RC8_9                            BANKMASK(RCSTA1), 6, a
#define RC9                              BANKMASK(RCSTA1), 6, a
#define RC92                             BANKMASK(RCSTA2), 6, b
#define RC93                             BANKMASK(RCSTA3), 6, b
#define RC94                             BANKMASK(RCSTA4), 6, b
#define RCD8                             BANKMASK(RCSTA1), 0, a
#define RCD82                            BANKMASK(RCSTA2), 0, b
#define RCD83                            BANKMASK(RCSTA3), 0, b
#define RCD84                            BANKMASK(RCSTA4), 0, b
#define RCEN1                            BANKMASK(SSP1CON2), 3, a
#define RCEN2                            BANKMASK(SSP2CON2), 3, b
#define RCIDL1                           BANKMASK(BAUDCON1), 6, a
#define RCIDL2                           BANKMASK(BAUDCON2), 6, b
#define RCIDL3                           BANKMASK(BAUDCON3), 6, b
#define RCIDL4                           BANKMASK(BAUDCON4), 6, b
#define RCMT                             BANKMASK(BAUDCON1), 6, a
#define RCMT1                            BANKMASK(BAUDCON1), 6, a
#define RCMT2                            BANKMASK(BAUDCON2), 6, b
#define RCMT3                            BANKMASK(BAUDCON3), 6, b
#define RCMT4                            BANKMASK(BAUDCON4), 6, b
#define RD0                              BANKMASK(PORTD), 0, a
#define RD1                              BANKMASK(PORTD), 1, a
#define RD161                            BANKMASK(T1CON), 1, a
#define RD163                            BANKMASK(T3CON), 1, a
#define RD165                            BANKMASK(T5CON), 1, b
#define RD2                              BANKMASK(PORTD), 2, a
#define RD3                              BANKMASK(PORTD), 3, a
#define RD4                              BANKMASK(PORTD), 4, a
#define RD5                              BANKMASK(PORTD), 5, a
#define RD6                              BANKMASK(PORTD), 6, a
#define RD7                              BANKMASK(PORTD), 7, a
#define RDE                              BANKMASK(PORTE), 0, a
#define RDPU                             BANKMASK(PADCFG1), 7, b
#define RE0                              BANKMASK(PORTE), 0, a
#define RE1                              BANKMASK(PORTE), 1, a
#define RE2                              BANKMASK(PORTE), 2, a
#define RE3                              BANKMASK(PORTE), 3, a
#define RE4                              BANKMASK(PORTE), 4, a
#define RE5                              BANKMASK(PORTE), 5, a
#define RE6                              BANKMASK(PORTE), 6, a
#define RE7                              BANKMASK(PORTE), 7, a
